## SQL at Scale with Spark SQL

Welcome to the SQL mini project. For this project, you will use the Domino Data Lab Platform and work through a series of exercises using Spark SQL. The dataset size may not be too big but the intent here is to familiarize yourself with the Spark SQL interface which scales easily to huge datasets, without you having to worry about changing your SQL queries. 

The data you need is present in the mini-project folder in the form of three CSV files. You need to make sure that these datasets are uploaded and present in the same directory as this notebook file, since we will be importing these files in Spark and create the following tables under the __`country_club`__ database using Spark SQL.

1. The __`bookings`__ table,
2. The __`facilities`__ table, and
3. The __`members`__ table.

You will be uploading these datasets shortly into Spark to understand how to create a database within minutes! Once the database and the tables are populated, you will be focusing on the mini-project questions.

In the mini project, you'll be asked a series of questions. You can solve them using the Domino platform, but for the final deliverable, please download this notebook as an IPython notebook (__`File -> Export -> IPython Notebook`__) and upload it to your GitHub.

# Checking Existence of Spark Environment Variables

Make sure your notebook is loaded using a PySpark Workspace. If you open up a regular Jupyter workspace the following variables might not exist

In [3]:
spark

In [4]:
sqlContext

### Run the following if you failed to open a notebook in the PySpark Workspace

This will work assuming you are using Spark in the cloud on domino or you might need to configure with your own spark instance if you are working offline

In [6]:
if 'sc' not in locals():
    from pyspark.context import SparkContext
    from pyspark.sql.context import SQLContext
    from pyspark.sql.session import SparkSession
    
    sc = SparkContext()
    sqlContext = SQLContext(sc)
    spark = SparkSession(sc)

# Create a utility function to run SQL commands

Instead of typing the same python functions repeatedly, we build a small function where you can just pass your query to get results.

- Remember we are using Spark SQL in PySpark
- We can't run multiple SQL statements in one go (no semi-colon ';' separated SQL statements)
- We can run multi-line SQL queries (but still has to be a single statement)

In [8]:
def run_sql(statement):
    try:
        result = sqlContext.sql(statement)
    except Exception as e:
        print(e.desc, '\n', e.stackTrace)
        return
    return result

# Creating the Database

We will first create our database in which we will be creating our three tables of interest

In [10]:
run_sql('drop database if exists country_club cascade')
run_sql('create database country_club')
dbs = run_sql('show databases')
dbs.toPandas()

# Creating the Tables

In this section, we will be creating the three tables of interest and populate them with the data from the CSV files already available to you.

To get started, first make sure you have already uploaded the three CSV files and they are present in the same directory as the notebook.

Once you have done this, please remember to execute the following code to build the dataframes which will be saved as tables in our database

In [12]:
# File location and type
file_location_bookings = "/FileStore/tables/Bookings.csv"
file_location_facilities = "/FileStore/tables/Facilities.csv"
file_location_members = "/FileStore/tables/Members.csv"

file_type = "csv"

# CSV options
infer_schema = "false"
first_row_is_header = "True"
delimiter = ","

# The applied options are for CSV files. For other file types, these will be ignored.
bookings_df = (spark.read.format(file_type) 
                    .option("inferSchema", infer_schema) 
                    .option("header", first_row_is_header) 
                    .option("sep", delimiter) 
                    .load(file_location_bookings))

facilities_df = (spark.read.format(file_type) 
                      .option("inferSchema", infer_schema) 
                      .option("header", first_row_is_header) 
                      .option("sep", delimiter) 
                      .load(file_location_facilities))

members_df = (spark.read.format(file_type) 
                      .option("inferSchema", infer_schema) 
                      .option("header", first_row_is_header) 
                      .option("sep", delimiter) 
                      .load(file_location_members))

### Viewing the dataframe schemas

We can take a look at the schemas of our potential tables to be written to our database soon

In [14]:
print('Bookings Schema')
bookings_df.printSchema()
print('Facilities Schema')
facilities_df.printSchema()
print('Members Schema')
members_df.printSchema()

# Create permanent tables
We will be creating three permanent tables here in our __`country_club`__ database as we discussed previously with the following code

In [17]:
permanent_table_name_bookings = "country_club.Bookings"
bookings_df.write.format("parquet").saveAsTable(permanent_table_name_bookings)

permanent_table_name_facilities = "country_club.Facilities"
facilities_df.write.format("parquet").saveAsTable(permanent_table_name_facilities)

permanent_table_name_members = "country_club.Members"
members_df.write.format("parquet").saveAsTable(permanent_table_name_members)

### Refresh tables and check them

In [19]:
run_sql('use country_club')
run_sql('REFRESH table bookings')
run_sql('REFRESH table facilities')
run_sql('REFRESH table members')
tbls = run_sql('show tables')
tbls.toPandas()

# Test a sample SQL query

__Note:__ You can use multi-line SQL queries (but still a single statement) as follows

In [21]:
result = run_sql('''
                    SELECT * 
                    FROM bookings 
                    LIMIT 3
                 ''')
result.toPandas()

# Your Turn: Solve the following questions with Spark SQL

- Make use of the `run_sql(...)` function as seen in the previous example
- You can write multi-line SQL queries but it has to be a single statement (no use of semi-colons ';')
- Make use of the `toPandas()` function as depicted in the previous example to display the query results

In [23]:
facilities_df.head(1000)

#### Q1: Some of the facilities charge a fee to members, but some do not. Please list the names of the facilities that do.

In [25]:
result = run_sql('''
                  Select facid, name from facilities
                  where membercost >0
                   
                 ''')
result.toPandas()

####  Q2: How many facilities do not charge a fee to members?

In [27]:
result = run_sql('''
                 Select facid, name from facilities
                  where membercost ==0
                 ''')
result.toPandas()

#### Q3: How can you produce a list of facilities that charge a fee to members, where the fee is less than 20% of the facility's monthly maintenance cost? 
#### Return the facid, facility name, member cost, and monthly maintenance of the facilities in question.

In [29]:
result = run_sql('''
                 Select facid, name, membercost, monthlymaintenance from facilities
                 where membercost < 0.2*monthlymaintenance and membercost>0
                ''')
result.toPandas()

#### Q4: How can you retrieve the details of facilities with ID 1 and 5? Write the query without using the OR operator.

In [31]:
result = run_sql('''
                select * from facilities
                where facid==1
                Union all
                select * from facilities
                where facid==5
                   
                ''')
result.toPandas()

#### Q5: How can you produce a list of facilities, with each labelled as 'cheap' or 'expensive', depending on if their monthly maintenance cost is more than $100? 
#### Return the name and monthly maintenance of the facilities in question.

In [33]:
result = run_sql('''
                 select monthlymaintenance,
                 case when monthlymaintenance > 100 then "expensive"
                 ELSE "cheap" END AS name
                 from facilities
                 ''')
result.toPandas()

In [34]:
members_df.head(5)

#### Q6: You'd like to get the first and last name of the last member(s) who signed up. Do not use the LIMIT clause for your solution.

In [36]:
result = run_sql('''
                 SELECT surname, firstname FROM members
                 where joindate == "2012-09-26 18:08:45"
                 order by joindate desc
                 ''')
result.toPandas()

In [37]:
bookings_df.head(5)

In [38]:
facilities_df.head(5)

In [39]:
members_df.head(5)

####  Q7: How can you produce a list of all members who have used a tennis court?
- Include in your output the name of the court, and the name of the member formatted as a single column. 
- Ensure no duplicate data
- Also order by the member name.

In [41]:
result = run_sql('''select distinct concat (com1.surname, " ", com1.firstname) as person_name, fac.name from (
                 select book.facid, book.memid, mem.surname, mem.firstname from bookings as booK
                 join members as mem on book.memid = mem.memid
                 Where mem.surname <> "GUEST"
                 ) as com1
                 join facilities as fac on com1.facid =fac.facid
                 where fac.name like "Tennis%"
                 order by person_name
                 ''')
result.toPandas()

#### Q8: How can you produce a list of bookings on the day of 2012-09-14 which will cost the member (or guest) more than $30? 

- Remember that guests have different costs to members (the listed costs are per half-hour 'slot')
- The guest user's ID is always 0. 

#### Include in your output the name of the facility, the name of the member formatted as a single column, and the cost.

- Order by descending cost, and do not use any subqueries.

In [43]:
result = run_sql('''
                    select concat (surname, " ", firstname) as personal_name, f.name as facility_name, 2*f.membercost*b.slots as cost from bookings as b inner join 
                    members as m on m.memid = b.memid inner join facilities as f on f.facid=b.facid
                    where m.memid<>0 and 2*f.membercost*b.slots >30 and b.starttime between "2012-09-14 00:00:00" and "2012-09-14 24:00:00"
                    Union all
                    select concat (surname, " ", firstname) as personal_name, f.name as facility_name, f.guestcost*b.slots as cost from bookings as b inner join 
                    members as m on m.memid = b.memid inner join facilities as f on f.facid=b.facid
                    where m.memid=0 and f.guestcost*b.slots >30 and b.starttime between "2012-09-14 00:00:00" and "2012-09-14 24:00:00"
                    order by cost
       
                 ''')
result.toPandas()

#### Q9: This time, produce the same result as in Q8, but using a subquery.

In [45]:
result = run_sql('''
                   select personal_name, starttime,facility_name, cost from (select personal_name, starttime, facility_name, memid, guecost, case when memid=0 then guecost else memcost end as cost from 
                   (select personal_name, memid, starttime, f.name as facility_name, f.guestcost*tem.slots as guecost, f.membercost*2*tem.slots as memcost 
                   from (select concat (surname, " ", firstname) as personal_name, b.memid as memid, facid, b.starttime as starttime, slots 
                   from bookings as b inner join members as m on m.memid = b.memid) as tem 
                   inner join facilities f on f.facid=tem.facid) as mid_tem)
                   where cost >30 and memid=0 and starttime between "2012-09-14 00:00:00" and "2012-09-14 24:00:00" or memid<>0 and cost >30 and starttime between "2012-09-14 00:00:00" and "2012-09-14 24:00:00"
                   order by cost
                   
                   
                   
                   
                   
                   
   
                 ''')
result.toPandas()

#### Q10: Produce a list of facilities with a total revenue less than 1000.
- The output should have facility name and total revenue, sorted by revenue. 
- Remember that there's a different cost for guests and members!

In [47]:
result = run_sql('''
                 select facid, sum(cost) as final_cost from
                 (select concat (surname, " ", firstname) as personal_name, b.memid as memid, b.facid as facid, f.name as name, f.membercost as memcost, f.guestcost as guecost,b.starttime as starttime, slots, case when b.memid=0 then f.guestcost*slots else f.membercost*2*slots end as cost
                   from bookings as b inner join members as m on m.memid = b.memid
                   inner join facilities f on f.facid= b.facid)
                   group by facid
                   having final_cost<1000
                 ''')
result.toPandas()